# imports

In [95]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists, create_database
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus as urlquote
import json
from sqlalchemy.types import *

In [96]:
import json
with open('C:\\Users\\Sly\\.secret\\yelp_api.json') as f: #change the path to match YOUR path!!
    login = json.load(f)
login.keys()

dict_keys(['client-id', 'api-key'])

In [97]:
from yelpapi import YelpAPI
yelp_api = YelpAPI(login["api-key"], timeout_s=5.0)
yelp_api

# Create engine/db

In [98]:
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
connection = "mysql+pymysql://root:ShadowGarden!1898@localhost/Movies"

In [99]:
engine = create_engine(connection)

engine

Engine(mysql+pymysql://root:***@localhost/Movies)

In [100]:
# Check if the database exists. If not, create it.
if database_exists(connection) == False:
  create_database(connection)
else:
  print('The database already exists')

The database already exists

# Load the data

In [101]:
##Load in data sets
basics = pd.read_csv('Data/title_basics.csv.gz')
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,np.nan,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,np.nan,70,Drama
2,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016.0,np.nan,90,Drama
3,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,np.nan,122,Drama
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,np.nan,100,"Comedy,Horror,Sci-Fi"

In [102]:
##Load in data sets, do NOT add akas
ratings = pd.read_csv('Data/title_ratings.csv.gz')
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1990
1  tt0000002            5.8       264
2  tt0000003            6.5      1863
3  tt0000004            5.5       177
4  tt0000005            6.2      2647

In [103]:
##Load in data sets of 2000 movies
df2000 = pd.read_csv('Data/final_tmdb_data_2000.csv.gz')
df2000.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.500,22.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.450,10.0,NaN
3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,4.000,1.0,NaN
4,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,843.0,cn,花樣年華,...,14204632.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.111,2302.0,PG

In [104]:
##Load in data sets of 2001 movies
df2001 = pd.read_csv('Data/final_tmdb_data_2001.csv.gz')
df2001.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0035423,0.0,/hfeiSfWYujh6MKhtGTXyK3DD4nN.jpg,NaN,48000000.0,"[{'id': 10749, 'name': 'Romance'}, {'id': 14, ...",NaN,11232.0,en,Kate & Leopold,...,76019048.0,118.0,"[{'english_name': 'French', 'iso_639_1': 'fr',...",Released,"If they lived in the same century, they'd be p...",Kate & Leopold,0.0,6.331,1219.0,PG-13
2,tt0114447,0.0,NaN,NaN,0.0,"[{'id': 53, 'name': 'Thriller'}, {'id': 28, 'n...",NaN,151007.0,en,The Silent Force,...,0.0,90.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,They left him for dead... They should have fin...,The Silent Force,0.0,5.000,3.0,NaN
3,tt0116916,0.0,/rFpHBidSlhjflmnLu7BZilyKeQR.jpg,NaN,0.0,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...",NaN,73549.0,en,The Dark Mist,...,0.0,101.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,NaN,The Dark Mist,0.0,3.500,2.0,PG
4,tt0118589,0.0,/9NZAirJahVilTiDNCHLFcdkwkiy.jpg,NaN,22000000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10402, 'n...",NaN,10696.0,en,Glitter,...,5271666.0,104.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,"In music she found her dream, her love, herself.",Glitter,0.0,4.442,130.0,PG-13

# Transform the data

In [105]:
#Concatenate TMDB files into one dataframe
tmdb_data = pd.concat((df2000, df2001))
tmdb_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2604 entries, 0 to 1348
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                2604 non-null   object
 1   adult                  2602 non-null   float64
 2   backdrop_path          1445 non-null   object
 3   belongs_to_collection  211 non-null    object
 4   budget                 2602 non-null   float64
 5   genres                 2602 non-null   object
 6   homepage               170 non-null    object
 7   id                     2602 non-null   float64
 8   original_language      2602 non-null   object
 9   original_title         2602 non-null   object
 10  overview               2559 non-null   object
 11  popularity             2602 non-null   float64
 12  poster_path            2361 non-null   object
 13  production_companies   2602 non-null   object
 14  production_countries   2602 non-null   object
 15  release_date           2581 non-null   object
 16  revenue                2602 non-null   float64
 17  runtime                2602 non-null   float64
 18  spoken_languages       2602 non-null   object
 19  status                 2602 non-null   object
 20  tagline                1119 non-null   object
 21  title                  2602 non-null   object
 22  video                  2602 non-null   float64
 23  vote_average           2602 non-null   float64
 24  vote_count             2602 non-null   float64
 25  certification          815 non-null    object
dtypes: float64(9), object(17)
memory usage: 549.3+ KB

In [106]:
# Drop columns from tmbd_data
tmdb_data = tmdb_data.drop(columns = ['adult', 'backdrop_path', 
                                      'belongs_to_collection', 'genres', 
                                      'homepage', 'id', 'original_language', 
                                      'original_title', 'overview', 'popularity', 
                                      'poster_path', 'production_companies', 
                                      'production_countries', 'release_date', 
                                      'runtime', 'spoken_languages', 'status', 
                                      'tagline', 'title', 'video', 'vote_average', 
                                      'vote_count'])
#verify
tmdb_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2604 entries, 0 to 1348
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   imdb_id        2604 non-null   object
 1   budget         2602 non-null   float64
 2   revenue        2602 non-null   float64
 3   certification  815 non-null    object
dtypes: float64(2), object(2)
memory usage: 101.7+ KB

In [107]:
# Check basics column normalization accuracy
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,np.nan,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,np.nan,70,Drama
2,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016.0,np.nan,90,Drama
3,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,np.nan,122,Drama
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,np.nan,100,"Comedy,Horror,Sci-Fi"

In [108]:
# Create a column with list of genres
basics['genres_split'] = basics['genres'].str.split(',')
basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,np.nan,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,np.nan,70,Drama,[Drama]
2,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016.0,np.nan,90,Drama,[Drama]
3,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,np.nan,122,Drama,[Drama]
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,np.nan,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
...,...,...,...,...,...,...,...,...,...,...
82004,tt9914942,movie,Life Without Sara Amat,La vida sense la Sara Amat,0,2019.0,np.nan,74,Drama,[Drama]
82005,tt9915872,movie,The Last White Witch,Boku no kanojo wa mahoutsukai,0,2019.0,np.nan,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
82006,tt9916170,movie,The Rehearsal,O Ensaio,0,2019.0,np.nan,51,Drama,[Drama]
82007,tt9916190,movie,Safeguard,Safeguard,0,2020.0,np.nan,95,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
82008,tt9916362,movie,Coven,Akelarre,0,2020.0,np.nan,92,"Drama,History","[Drama, History]"

In [109]:
# Separate list of genres into new rows
exploded_genres = basics.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,np.nan,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,np.nan,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,np.nan,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,np.nan,70,Drama,Drama
2,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016.0,np.nan,90,Drama,Drama
...,...,...,...,...,...,...,...,...,...,...
82007,tt9916190,movie,Safeguard,Safeguard,0,2020.0,np.nan,95,"Action,Adventure,Thriller",Action
82007,tt9916190,movie,Safeguard,Safeguard,0,2020.0,np.nan,95,"Action,Adventure,Thriller",Adventure
82007,tt9916190,movie,Safeguard,Safeguard,0,2020.0,np.nan,95,"Action,Adventure,Thriller",Thriller
82008,tt9916362,movie,Coven,Akelarre,0,2020.0,np.nan,92,"Drama,History",Drama
82008,tt9916362,movie,Coven,Akelarre,0,2020.0,np.nan,92,"Drama,History",History

In [110]:
#Sort genres alphabetically
unique_genres = sorted(exploded_genres['genres_split'].unique())

In [111]:
# Create title_genres table
title_genres = exploded_genres[['tconst', 'genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0068865        Drama

In [112]:
# Create genre mapper dict
genre_int = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_int))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

In [113]:
# Make new integer column in title_genres table
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres = title_genres.drop(columns = 'genres_split')
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0068865         7

In [114]:
# Convert genre map dictionary to genres table
genres = pd.DataFrame({'Genre_Name': genre_map.keys(),
                      'Genre_ID': genre_map.values()})
genres.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [115]:
# Drop columns from title_basics df
basics = basics.drop(columns = ['titleType', 'originalTitle', 
                                            'isAdult', 'endYear', 'genres', 
                                            'genres_split'])
#verify
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 82009 entries, 0 to 82008
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          82009 non-null  object
 1   primaryTitle    82009 non-null  object
 2   startYear       82009 non-null  float64
 3   runtimeMinutes  82009 non-null  int64
dtypes: float64(1), int64(1), object(2)
memory usage: 2.5+ MB

In [116]:
# Calculate max string lengths for object columns
id_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primaryTitle'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
basics_schema = {
    "tconst": String(id_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'runtimeMinutes':Integer()}

In [117]:
# Save table to sql
basics.to_sql('basics', engine, dtype = basics_schema, 
                    if_exists = 'replace', index = False)

82009

In [118]:
# Add tconst as primary key
engine.execute('ALTER TABLE basics ADD PRIMARY KEY (`tconst`);')

In [119]:
# query for first five rows of basics
q = """
SELECT *
FROM basics
LIMIT 5;
"""
pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0068865,Lives of Performers,2016.0,90
3,tt0069049,The Other Side of the Wind,2018.0,122
4,tt0088751,The Naked Monster,2005.0,100

In [120]:
# Check data types of ratings
ratings.dtypes

tconst            object
averageRating    float64
numVotes           int64
dtype: object

In [121]:
# Calculate max string lengths for object columns
id_len = ratings['tconst'].fillna('').map(len).max()

## Create a schema dictonary using Sqlalchemy datatype objects
ratings_schema = {
    "tconst": String(id_len+1), 
    'averageRating':Float(),
    'numVotes':Integer()}

In [122]:
# Save table to sql
ratings.to_sql('ratings', engine, dtype = ratings_schema, 
                    if_exists = 'replace', index = False)

1340671

In [123]:
# Add tconst as primary key
engine.execute('ALTER TABLE ratings ADD PRIMARY KEY (`tconst`);')

In [124]:
# query for first five rows of ratings
q = """
SELECT *
FROM ratings
LIMIT 5;
"""
pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1990
1  tt0000002            5.8       264
2  tt0000003            6.5      1863
3  tt0000004            5.5       177
4  tt0000005            6.2      2647

In [125]:
# Save table to sql
title_genres.to_sql('title_genres', engine, if_exists = 'replace')

153834

In [126]:
# query for first five rows of title genres
q = """
SELECT *
FROM title_genres
LIMIT 5;
"""
pd.read_sql(q, engine)

   index     tconst  genre_id
0      0  tt0035423         5
1      0  tt0035423         9
2      0  tt0035423        18
3      1  tt0062336         7
4      2  tt0068865         7

In [127]:
# Check data types of df
genres.dtypes

Genre_Name    object
Genre_ID       int64
dtype: object

In [128]:
# Save table to sql
genres.set_index('Genre_ID').to_sql('genres', engine, if_exists = 'replace', index=True)

25

In [129]:
# query for first five rows of genres
q = """
SELECT *
FROM genres
LIMIT 5;
"""
pd.read_sql(q, engine)

   Genre_ID Genre_Name
0         0     Action
1         1      Adult
2         2  Adventure
3         3  Animation
4         4  Biography

In [130]:
#Drop first row
tmdb_data = tmdb_data.drop([0])
tmdb_data.head()

     imdb_id      budget     revenue certification
1  tt0113026  10000000.0         0.0           NaN
2  tt0113092         0.0         0.0           NaN
3  tt0116391         0.0         0.0           NaN
4  tt0118694    150000.0  14204632.0            PG
5  tt0118852         0.0         0.0             R

In [131]:
# Check data types of df
tmdb_data.dtypes

imdb_id           object
budget           float64
revenue          float64
certification     object
dtype: object

In [132]:
# Calculate max string lengths for object columns
id_len = tmdb_data['imdb_id'].fillna('').map(len).max()
cert_len = tmdb_data['certification'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
tmdb_schema = {
    "imdb_id": String(id_len+1),
    'budget':Float(),
    'revenue':Float(),
    'certification':Text(cert_len+1)}

In [133]:
# Save table to sql
tmdb_data.to_sql('tmdb_data', engine, dtype = tmdb_schema, 
                    if_exists = 'replace', index = False)

2602

In [134]:
# Add imdb_id as primary key
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

In [135]:
# query the first five rows of tmdb_data
q = """
SELECT *
FROM tmdb_data
LIMIT 5;
"""
pd.read_sql(q, engine)

     imdb_id      budget     revenue certification
0  tt0035423  48000000.0  76019000.0         PG-13
1  tt0113026  10000000.0         0.0          None
2  tt0113092         0.0         0.0          None
3  tt0114447         0.0         0.0          None
4  tt0116391         0.0         0.0          None

In [136]:
# Show tables in database
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_movies
0           basics
1           genres
2          ratings
3     title_genres
4        tmdb_data